kgun2g/somfy-rts-remote-by-thread/sdkconfig.defaults.c6_thread
CONFIG_IDF_TARGET="esp32c6"

# libsodium
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# NIMBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
# ★2026-08-24 n → y — h2_thread 와 같은 이유(그쪽 주석에 근거 전체).
#  이 파일은 xiao-c6·gnpe-c6 가 공통으로 쓴다. xiao-c6 는 오버레이
#  (sdkconfig.defaults.xiao_c6)에서 y 로 덮고 있었지만 **gnpe-c6 는 오버레이가
#  없어 n 이 그대로 살아 있었다** — H2 와 똑같은 적용 누락이다.
#  요지: `bt` 락(APB_FREQ_MAX)이 부팅부터 100% 잡혀 light sleep 이 진입조차 못 한다.
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y

# Enable OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

# Disable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=n

# Use a custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LwIP config for OpenThread
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Enable OTA Requestor
CONFIG_ENABLE_OTA_REQUESTOR=y

# Disable STA for ESP32C6
CONFIG_ENABLE_WIFI_STATION=n

# Button
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000

# Enable chip shell
CONFIG_ENABLE_CHIP_SHELL=y

# ESP32-C6-DevKitM-1 Settings
# Buttons
CONFIG_BSP_BUTTONS_NUM=1
CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
CONFIG_BSP_BUTTON_1_GPIO=9
CONFIG_BSP_BUTTON_1_LEVEL=0
# LEDs
CONFIG_BSP_LEDS_NUM=1
CONFIG_BSP_LED_TYPE_RGB=y
CONFIG_BSP_LED_RGB_GPIO=8
CONFIG_BSP_LED_RGB_BACKEND_RMT=y

# ── SSD1306 OLED 컴포넌트 (실제 프로젝트와 동일) ──
# oled_ui.c 는 i2c_master_init() 에 명시 핀(IO1=SDA, IO0=SCL)을 직접
# 넘기므로 component 의 SCL/SDA Kconfig 는 미사용. 패널/포트/오프셋만 영향.
CONFIG_I2C_INTERFACE=y
# CONFIG_SPI_INTERFACE is not set
# CONFIG_SSD1306_128x32 is not set
CONFIG_SSD1306_128x64=y
CONFIG_OFFSETX=28
# CONFIG_FLIP is not set
CONFIG_SCL_GPIO=6
CONFIG_SDA_GPIO=5
CONFIG_RESET_GPIO=4
CONFIG_I2C_PORT_0=y
# CONFIG_LEGACY_DRIVER is not set

# ── Matter Time Synchronization 클러스터 ──
# SmartThings(커미셔너)가 페어링 시 + 주기적으로 SetUTCTime 으로 디바이스
# 시각을 설정 → ESP32 settimeofday() → OLED 시계가 허브 시각과 동기화.
# 기본 off 라 time-synchronization-server 가 컴파일 안 됨 → 활성화.
CONFIG_SUPPORT_TIME_SYNCHRONIZATION_CLUSTER=y

# ── Matter OTA: 보드별 고유 Product ID (OTA 이미지 보드 매칭용) ──
CONFIG_DEVICE_PRODUCT_ID=0x8000
CONFIG_BLE_DEVICE_NAME_PREFIX="MATTER-"
CONFIG_CHIP_PROJECT_CONFIG="main/CHIPProjectConfig.h"

# ── 기기 고유 커미셔닝: eFuse 기반 discriminator/passcode (efuse_commissionable.cpp) ──
#   여러 대 제작 시 같은 QR/PIN 충돌 방지. DAC provider 는 별개라 유지.
CONFIG_CUSTOM_COMMISSIONABLE_DATA_PROVIDER=y

# ★★2026-08-25 절전 — light sleep 중 **플래시 전원 차단**.
#  IDF: "chip will try to power down flash as part of esp_light_sleep_start(),
#        which costs more time when chip wakes up."
#  전제 충족: SPIRAM 없음(depends on !SPIRAM).
#  ★부수 이득: 지금 켜둔 ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND 는 수면 중 Flash CS 를
#    풀업해 두는 대신 **수면 전류를 약 10uA 늘린다**. 플래시를 아예 내리면 그 누설
#    자체가 사라진다(워크어라운드는 그대로 둬도 무해).
#  ★위험: IDF 가 "there is a risk in powering down flash" 라고 명시한다. 깨어날 때
#    플래시 재초기화가 필요해 **회당 깨어있는 시간이 늘 수 있다** — 그러면 순이득이
#    없거나 마이너스다. 반드시 **깨어남 횟수가 아니라 깨어있는 시간**으로 판정할 것.
#    이상 동작(부팅 실패·랜덤 리셋)이 보이면 즉시 이 줄을 지운다.
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
